---
kind: property
id: P:Autodesk.Revit.DB.Analysis.EnergyDataSettings.EnergyModel
source: html/bd93969d-9bdd-2c43-7be3-694cdcbf65c1.htm
---
# Autodesk.Revit.DB.Analysis.EnergyDataSettings.EnergyModel Property

if this is on there should be an energy model dependent on the current AnalysisType
 if it is off the conceptual energy model should be turned off
 but setting this datum does not do the work, just reflects the state.

## Syntax (C#)
```csharp
public bool EnergyModel { get; set; }
```